Revit 2027 API
ConceptualConstructionType.MassSurfaceSubCategoryId Property
 The surface type subcategory element id associated with the ConceptualConstructionType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MassSurfaceSubCategoryId { get; }
Public ReadOnly Property MassSurfaceSubCategoryId As ElementId
	Get
public:
property ElementId^ MassSurfaceSubCategoryId {
	ElementId^ get ();
}
member MassSurfaceSubCategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace